flashfishgit/MPT3/Uebung1/STM32Base/system/cmsis/stm32f0xx_.h
/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ((uint32_t)0x00400000)
#define RTC_TR_HT                            ((uint32_t)0x00300000)        
#define RTC_TR_HT_0                          ((uint32_t)0x00100000)        
#define RTC_TR_HT_1                          ((uint32_t)0x00200000)        
#define RTC_TR_HU                            ((uint32_t)0x000F0000)        
#define RTC_TR_HU_0                          ((uint32_t)0x00010000)        
#define RTC_TR_HU_1                          ((uint32_t)0x00020000)        
#define RTC_TR_HU_2                          ((uint32_t)0x00040000)        
#define RTC_TR_HU_3                          ((uint32_t)0x00080000)        
#define RTC_TR_MNT                           ((uint32_t)0x00007000)        
#define RTC_TR_MNT_0                         ((uint32_t)0x00001000)        
#define RTC_TR_MNT_1                         ((uint32_t)0x00002000)        
#define RTC_TR_MNT_2                         ((uint32_t)0x00004000)        
#define RTC_TR_MNU                           ((uint32_t)0x00000F00)        
#define RTC_TR_MNU_0                         ((uint32_t)0x00000100)        
#define RTC_TR_MNU_1                         ((uint32_t)0x00000200)        
#define RTC_TR_MNU_2                         ((uint32_t)0x00000400)        
#define RTC_TR_MNU_3                         ((uint32_t)0x00000800)        
#define RTC_TR_ST                            ((uint32_t)0x00000070)        
#define RTC_TR_ST_0                          ((uint32_t)0x00000010)        
#define RTC_TR_ST_1                          ((uint32_t)0x00000020)        
#define RTC_TR_ST_2                          ((uint32_t)0x00000040)        
#define RTC_TR_SU                            ((uint32_t)0x0000000F)        
#define RTC_TR_SU_0                          ((uint32_t)0x00000001)        
#define RTC_TR_SU_1                          ((uint32_t)0x00000002)        
#define RTC_TR_SU_2                          ((uint32_t)0x00000004)        
#define RTC_TR_SU_3                          ((uint32_t)0x00000008)        

/********************  Bits definition for RTC_DR register  *******************/
#define RTC_DR_YT                            ((uint32_t)0x00F00000)        
#define RTC_DR_YT_0                          ((uint32_t)0x00100000)        
#define RTC_DR_YT_1                          ((uint32_t)0x00200000)        
#define RTC_DR_YT_2                          ((uint32_t)0x00400000)        
#define RTC_DR_YT_3                          ((uint32_t)0x00800000)        
#define RTC_DR_YU                            ((uint32_t)0x000F0000)        
#define RTC_DR_YU_0                          ((uint32_t)0x00010000)        
#define RTC_DR_YU_1                          ((uint32_t)0x00020000)        
#define RTC_DR_YU_2                          ((uint32_t)0x00040000)        
#define RTC_DR_YU_3                          ((uint32_t)0x00080000)        
#define RTC_DR_WDU                           ((uint32_t)0x0000E000)        
#define RTC_DR_WDU_0                         ((uint32_t)0x00002000)        
#define RTC_DR_WDU_1                         ((uint32_t)0x00004000)        
#define RTC_DR_WDU_2                         ((uint32_t)0x00008000)        
#define RTC_DR_MT                            ((uint32_t)0x00001000)        
#define RTC_DR_MU                            ((uint32_t)0x00000F00)        
#define RTC_DR_MU_0                          ((uint32_t)0x00000100)        
#define RTC_DR_MU_1                          ((uint32_t)0x00000200)        
#define RTC_DR_MU_2                          ((uint32_t)0x00000400)        
#define RTC_DR_MU_3                          ((uint32_t)0x00000800)        
#define RTC_DR_DT                            ((uint32_t)0x00000030)        
#define RTC_DR_DT_0                          ((uint32_t)0x00000010)        
#define RTC_DR_DT_1                          ((uint32_t)0x00000020)        
#define RTC_DR_DU                            ((uint32_t)0x0000000F)        
#define RTC_DR_DU_0                          ((uint32_t)0x00000001)        
#define RTC_DR_DU_1                          ((uint32_t)0x00000002)        
#define RTC_DR_DU_2                          ((uint32_t)0x00000004)        
#define RTC_DR_DU_3                          ((uint32_t)0x00000008)        

/********************  Bits definition for RTC_CR register  *******************/
#define RTC_CR_COE                           ((uint32_t)0x00800000)        
#define RTC_CR_OSEL                          ((uint32_t)0x00600000)        
#define RTC_CR_OSEL_0                        ((uint32_t)0x00200000)        
#define RTC_CR_OSEL_1                        ((uint32_t)0x00400000)        
#define RTC_CR_POL                           ((uint32_t)0x00100000)        
#define RTC_CR_COSEL                         ((uint32_t)0x00080000)        
#define RTC_CR_BKP                           ((uint32_t)0x00040000)        
#define RTC_CR_SUB1H                         ((uint32_t)0x00020000)        
#define RTC_CR_ADD1H                         ((uint32_t)0x00010000)        
#define RTC_CR_TSIE                          ((uint32_t)0x00008000)        
#define RTC_CR_WUTIE                         ((uint32_t)0x00004000)
#define RTC_CR_ALRAIE                        ((uint32_t)0x00001000)        
#define RTC_CR_TSE                           ((uint32_t)0x00000800)        
#define RTC_CR_WUTE                          ((uint32_t)0x00000400)        
#define RTC_CR_ALRAE                         ((uint32_t)0x00000100)        
#define RTC_CR_FMT                           ((uint32_t)0x00000040)        
#define RTC_CR_BYPSHAD                       ((uint32_t)0x00000020)        
#define RTC_CR_REFCKON                       ((uint32_t)0x00000010)        
#define RTC_CR_TSEDGE                        ((uint32_t)0x00000008)        
#define RTC_CR_WUCKSEL                       ((uint32_t)0x00000007)        
#define RTC_CR_WUCKSEL_0                     ((uint32_t)0x00000001)        
#define RTC_CR_WUCKSEL_1                     ((uint32_t)0x00000002)        
#define RTC_CR_WUCKSEL_2                     ((uint32_t)0x00000004)        

