flashfishgit/MPT3/Uebung1/STM32Base/system/cmsis/stm32f0xx_.h
/* Old bit definition maintained for legacy purpose */
#define RTC_CR_BCK                           RTC_CR_BKP
#define RTC_CR_CALSEL                        RTC_CR_COSEL

/********************  Bits definition for RTC_ISR register  ******************/
#define RTC_ISR_RECALPF                      ((uint32_t)0x00010000)        
#define RTC_ISR_TAMP3F                       ((uint32_t)0x00008000)        
#define RTC_ISR_TAMP2F                       ((uint32_t)0x00004000)        
#define RTC_ISR_TAMP1F                       ((uint32_t)0x00002000)        
#define RTC_ISR_TSOVF                        ((uint32_t)0x00001000)        
#define RTC_ISR_TSF                          ((uint32_t)0x00000800)        
#define RTC_ISR_WUTF                         ((uint32_t)0x00000400)        
#define RTC_ISR_ALRAF                        ((uint32_t)0x00000100)        
#define RTC_ISR_INIT                         ((uint32_t)0x00000080)        
#define RTC_ISR_INITF                        ((uint32_t)0x00000040)        
#define RTC_ISR_RSF                          ((uint32_t)0x00000020)        
#define RTC_ISR_INITS                        ((uint32_t)0x00000010)        
#define RTC_ISR_SHPF                         ((uint32_t)0x00000008)        
#define RTC_ISR_WUTWF                        ((uint32_t)0x00000004)        
#define RTC_ISR_ALRAWF                       ((uint32_t)0x00000001)        

/********************  Bits definition for RTC_PRER register  *****************/
#define RTC_PRER_PREDIV_A                    ((uint32_t)0x007F0000)        
#define RTC_PRER_PREDIV_S                    ((uint32_t)0x00007FFF)        

/********************  Bits definition for RTC_WUTR register  *****************/
#define RTC_WUTR_WUT                         ((uint32_t)0x0000FFFF)

/********************  Bits definition for RTC_ALRMAR register  ***************/
#define RTC_ALRMAR_MSK4                      ((uint32_t)0x80000000)        
#define RTC_ALRMAR_WDSEL                     ((uint32_t)0x40000000)        
#define RTC_ALRMAR_DT                        ((uint32_t)0x30000000)        
#define RTC_ALRMAR_DT_0                      ((uint32_t)0x10000000)        
#define RTC_ALRMAR_DT_1                      ((uint32_t)0x20000000)        
#define RTC_ALRMAR_DU                        ((uint32_t)0x0F000000)        
#define RTC_ALRMAR_DU_0                      ((uint32_t)0x01000000)        
#define RTC_ALRMAR_DU_1                      ((uint32_t)0x02000000)        
#define RTC_ALRMAR_DU_2                      ((uint32_t)0x04000000)        
#define RTC_ALRMAR_DU_3                      ((uint32_t)0x08000000)        
#define RTC_ALRMAR_MSK3                      ((uint32_t)0x00800000)        
#define RTC_ALRMAR_PM                        ((uint32_t)0x00400000)        
#define RTC_ALRMAR_HT                        ((uint32_t)0x00300000)        
#define RTC_ALRMAR_HT_0                      ((uint32_t)0x00100000)        
#define RTC_ALRMAR_HT_1                      ((uint32_t)0x00200000)        
#define RTC_ALRMAR_HU                        ((uint32_t)0x000F0000)        
#define RTC_ALRMAR_HU_0                      ((uint32_t)0x00010000)        
#define RTC_ALRMAR_HU_1                      ((uint32_t)0x00020000)        
#define RTC_ALRMAR_HU_2                      ((uint32_t)0x00040000)        
#define RTC_ALRMAR_HU_3                      ((uint32_t)0x00080000)        
#define RTC_ALRMAR_MSK2                      ((uint32_t)0x00008000)        
#define RTC_ALRMAR_MNT                       ((uint32_t)0x00007000)        
#define RTC_ALRMAR_MNT_0                     ((uint32_t)0x00001000)        
#define RTC_ALRMAR_MNT_1                     ((uint32_t)0x00002000)        
#define RTC_ALRMAR_MNT_2                     ((uint32_t)0x00004000)        
#define RTC_ALRMAR_MNU                       ((uint32_t)0x00000F00)        
#define RTC_ALRMAR_MNU_0                     ((uint32_t)0x00000100)        
#define RTC_ALRMAR_MNU_1                     ((uint32_t)0x00000200)        
#define RTC_ALRMAR_MNU_2                     ((uint32_t)0x00000400)        
#define RTC_ALRMAR_MNU_3                     ((uint32_t)0x00000800)        
#define RTC_ALRMAR_MSK1                      ((uint32_t)0x00000080)        
#define RTC_ALRMAR_ST                        ((uint32_t)0x00000070)        
#define RTC_ALRMAR_ST_0                      ((uint32_t)0x00000010)        
#define RTC_ALRMAR_ST_1                      ((uint32_t)0x00000020)        
#define RTC_ALRMAR_ST_2                      ((uint32_t)0x00000040)        
#define RTC_ALRMAR_SU                        ((uint32_t)0x0000000F)        
#define RTC_ALRMAR_SU_0                      ((uint32_t)0x00000001)        
#define RTC_ALRMAR_SU_1                      ((uint32_t)0x00000002)        
#define RTC_ALRMAR_SU_2                      ((uint32_t)0x00000004)        
#define RTC_ALRMAR_SU_3                      ((uint32_t)0x00000008)        

/********************  Bits definition for RTC_WPR register  ******************/
#define RTC_WPR_KEY                          ((uint32_t)0x000000FF)        

/********************  Bits definition for RTC_SSR register  ******************/
#define RTC_SSR_SS                           ((uint32_t)0x0003FFFF)        

/********************  Bits definition for RTC_SHIFTR register  ***************/
#define RTC_SHIFTR_SUBFS                     ((uint32_t)0x00007FFF)        
#define RTC_SHIFTR_ADD1S                     ((uint32_t)0x80000000)        

/********************  Bits definition for RTC_TSTR register  *****************/
#define RTC_TSTR_PM                          ((uint32_t)0x00400000)        
#define RTC_TSTR_HT                          ((uint32_t)0x00300000)        
#define RTC_TSTR_HT_0                        ((uint32_t)0x00100000)        
#define RTC_TSTR_HT_1                        ((uint32_t)0x00200000)        
#define RTC_TSTR_HU                          ((uint32_t)0x000F0000)        
#define RTC_TSTR_HU_0                        ((uint32_t)0x00010000)        
#define RTC_TSTR_HU_1                        ((uint32_t)0x00020000)        
#define RTC_TSTR_HU_2                        ((uint32_t)0x00040000)        
#define RTC_TSTR_HU_3                        ((uint32_t)0x00080000)        
#define RTC_TSTR_MNT                         ((uint32_t)0x00007000)        
#define RTC_TSTR_MNT_0                       ((uint32_t)0x00001000)        
#define RTC_TSTR_MNT_1                       ((uint32_t)0x00002000)        
#define RTC_TSTR_MNT_2                       ((uint32_t)0x00004000)        
#define RTC_TSTR_MNU                         ((uint32_t)0x00000F00)        
#define RTC_TSTR_MNU_0                       ((uint32_t)0x00000100)        
#define RTC_TSTR_MNU_1                       ((uint32_t)0x00000200)        
#define RTC_TSTR_MNU_2                       ((uint32_t)0x00000400)        
#define RTC_TSTR_MNU_3                       ((uint32_t)0x00000800)        
#define RTC_TSTR_ST                          ((uint32_t)0x00000070)        
#define RTC_TSTR_ST_0                        ((uint32_t)0x00000010)        
#define RTC_TSTR_ST_1                        ((uint32_t)0x00000020)        
#define RTC_TSTR_ST_2                        ((uint32_t)0x00000040)        
#define RTC_TSTR_SU                          ((uint32_t)0x0000000F)        
#define RTC_TSTR_SU_0                        ((uint32_t)0x00000001)        
#define RTC_TSTR_SU_1                        ((uint32_t)0x00000002)        
#define RTC_TSTR_SU_2                        ((uint32_t)0x00000004)        
#define RTC_TSTR_SU_3                        ((uint32_t)0x00000008)        

/********************  Bits definition for RTC_TSDR register  *****************/
#define RTC_TSDR_WDU                         ((uint32_t)0x0000E000)        
#define RTC_TSDR_WDU_0                       ((uint32_t)0x00002000)        
#define RTC_TSDR_WDU_1                       ((uint32_t)0x00004000)        
#define RTC_TSDR_WDU_2                       ((uint32_t)0x00008000)        
#define RTC_TSDR_MT                          ((uint32_t)0x00001000)        
#define RTC_TSDR_MU                          ((uint32_t)0x00000F00)        
#define RTC_TSDR_MU_0                        ((uint32_t)0x00000100)        
#define RTC_TSDR_MU_1                        ((uint32_t)0x00000200)        
#define RTC_TSDR_MU_2                        ((uint32_t)0x00000400)        
#define RTC_TSDR_MU_3                        ((uint32_t)0x00000800)        
#define RTC_TSDR_DT                          ((uint32_t)0x00000030)        
#define RTC_TSDR_DT_0                        ((uint32_t)0x00000010)        
#define RTC_TSDR_DT_1                        ((uint32_t)0x00000020)        
#define RTC_TSDR_DU                          ((uint32_t)0x0000000F)        
#define RTC_TSDR_DU_0                        ((uint32_t)0x00000001)        
#define RTC_TSDR_DU_1                        ((uint32_t)0x00000002)        
#define RTC_TSDR_DU_2                        ((uint32_t)0x00000004)        
#define RTC_TSDR_DU_3                        ((uint32_t)0x00000008)        

/********************  Bits definition for RTC_TSSSR register  ****************/
#define RTC_TSSSR_SS                         ((uint32_t)0x0003FFFF)

/********************  Bits definition for RTC_CALR register  ******************/
#define RTC_CALR_CALP                         ((uint32_t)0x00008000)        
#define RTC_CALR_CALW8                        ((uint32_t)0x00004000)        
#define RTC_CALR_CALW16                       ((uint32_t)0x00002000)        
#define RTC_CALR_CALM                         ((uint32_t)0x000001FF)        
#define RTC_CALR_CALM_0                       ((uint32_t)0x00000001)        
#define RTC_CALR_CALM_1                       ((uint32_t)0x00000002)        
#define RTC_CALR_CALM_2                       ((uint32_t)0x00000004)        
#define RTC_CALR_CALM_3                       ((uint32_t)0x00000008)        
#define RTC_CALR_CALM_4                       ((uint32_t)0x00000010)        
#define RTC_CALR_CALM_5                       ((uint32_t)0x00000020)        
#define RTC_CALR_CALM_6                       ((uint32_t)0x00000040)        
#define RTC_CALR_CALM_7                       ((uint32_t)0x00000080)        
#define RTC_CALR_CALM_8                       ((uint32_t)0x00000100)

/* Old Bits definition for RTC_CAL register maintained for legacy purpose */
#define RTC_CAL_CALP                         RTC_CALR_CALP  
#define RTC_CAL_CALW8                        RTC_CALR_CALW8 
#define RTC_CAL_CALW16                       RTC_CALR_CALW16
#define RTC_CAL_CALM                         RTC_CALR_CALM  
#define RTC_CAL_CALM_0                       RTC_CALR_CALM_0
#define RTC_CAL_CALM_1                       RTC_CALR_CALM_1
#define RTC_CAL_CALM_2                       RTC_CALR_CALM_2
#define RTC_CAL_CALM_3                       RTC_CALR_CALM_3
#define RTC_CAL_CALM_4                       RTC_CALR_CALM_4
#define RTC_CAL_CALM_5                       RTC_CALR_CALM_5
#define RTC_CAL_CALM_6                       RTC_CALR_CALM_6
#define RTC_CAL_CALM_7                       RTC_CALR_CALM_7
#define RTC_CAL_CALM_8                       RTC_CALR_CALM_8

/********************  Bits definition for RTC_TAFCR register  ****************/
#define RTC_TAFCR_PC15MODE                   ((uint32_t)0x00800000)
#define RTC_TAFCR_PC15VALUE                  ((uint32_t)0x00400000)
#define RTC_TAFCR_PC14MODE                   ((uint32_t)0x00200000)
#define RTC_TAFCR_PC14VALUE                  ((uint32_t)0x00100000)
#define RTC_TAFCR_PC13MODE                   ((uint32_t)0x00080000)
#define RTC_TAFCR_PC13VALUE                  ((uint32_t)0x00040000)        
#define RTC_TAFCR_TAMPPUDIS                  ((uint32_t)0x00008000)        
#define RTC_TAFCR_TAMPPRCH                   ((uint32_t)0x00006000)        
#define RTC_TAFCR_TAMPPRCH_0                 ((uint32_t)0x00002000)        
#define RTC_TAFCR_TAMPPRCH_1                 ((uint32_t)0x00004000)        
#define RTC_TAFCR_TAMPFLT                    ((uint32_t)0x00001800)        
#define RTC_TAFCR_TAMPFLT_0                  ((uint32_t)0x00000800)        
#define RTC_TAFCR_TAMPFLT_1                  ((uint32_t)0x00001000)        
#define RTC_TAFCR_TAMPFREQ                   ((uint32_t)0x00000700)        
#define RTC_TAFCR_TAMPFREQ_0                 ((uint32_t)0x00000100)        
#define RTC_TAFCR_TAMPFREQ_1                 ((uint32_t)0x00000200)        
#define RTC_TAFCR_TAMPFREQ_2                 ((uint32_t)0x00000400)        
#define RTC_TAFCR_TAMPTS                     ((uint32_t)0x00000080)        
#define RTC_TAFCR_TAMP3EDGE                  ((uint32_t)0x00000040)        
#define RTC_TAFCR_TAMP3E                     ((uint32_t)0x00000020)        
#define RTC_TAFCR_TAMP2EDGE                  ((uint32_t)0x00000010)        
#define RTC_TAFCR_TAMP2E                     ((uint32_t)0x00000008)        
#define RTC_TAFCR_TAMPIE                     ((uint32_t)0x00000004)        
#define RTC_TAFCR_TAMP1TRG                   ((uint32_t)0x00000002)        
#define RTC_TAFCR_TAMP1E                     ((uint32_t)0x00000001)        

